articles/rightside.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Drawing on the Right Side of the Brain</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Drawing on the Right Side of the Brain</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org406716e">Book Review: Drawing on the Right Side of the Brain</a>
<ul>
<li><a href="#orgd711285">How to Start Drawing</a></li>
<li><a href="#org298d4e5">It's Just 40 Hours Away</a></li>
<li><a href="#orgd4dc84d">Is "Democratizing Art" a Sham?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org406716e" class="outline-1">
<h1 id="org406716e">Book Review: Drawing on the Right Side of the Brain</h1>
<div class="outline-text-1" id="text-org406716e">
<p>
This is a book of drawing exercises. I won't beat around the bush here: the majority of this book is pop psychology filler which does not hold up to modern reproduction efforts, and there are several irrelevant tangents about unrelated topice (e.g. art teachers in public education not being able to draw). As a book, it is not great, probably not a book well-suited for cognitive scientists in the current era.
</p>

<p>
But embedded in this not-so-great book are a bunch of drawing exercises with this incorrect science used to vaguely explain the use. It feels only fair to judge this book based on it's actual merit, that is, whether or not you come out the other end with the ability to draw. For acquiring skills, even poor analogies which don't reflect reality can sometimes be helpful frameworks for learning something new. Does that hold true here?
</p>
</div>

<div id="outline-container-orgd711285" class="outline-2">
<h2 id="orgd711285">How to Start Drawing</h2>
<div class="outline-text-2" id="text-orgd711285">
<ul class="org-ul">
<li>Preinstruction Drawings: Self-Portrait, Face from Memory, Drawing of Hand</li>
<li>Vase-Head Illusion</li>
<li>Upside Down Drawing (1 Picasso, 2 other random drawings)</li>
<li>Trace picture of hand, freehand draw that drawing right-side up</li>
<li>Pure Contour Drawing (Draw looking away from object)</li>
<li>Crosshair Viewfinder Modified Contour Drawing of Hand</li>
<li>Viewfinder Chair Negative Space drawing</li>
<li>Perspective Hallway Drawing</li>
<li>Corner of Room 2-point perspective w/ sighting + viewfinder</li>
<li>Corner of Room 2-point perspective w/ sighting, no viewfinder</li>
<li>Sighting Drawing in 2-point perspective</li>
<li>Copy Mdm Pierre Gautreau drawing</li>
<li>Draw a side profile of any person</li>
<li>Copy Steichen self portrait</li>
<li>Crosshatching exercise</li>
<li>Self portrait with lighting</li>
</ul>
</div>
</div>

<div id="outline-container-org298d4e5" class="outline-2">
<h2 id="org298d4e5">It's Just 40 Hours Away</h2>
<div class="outline-text-2" id="text-org298d4e5">
<p>
This book gives the impression of being an abbreviated summary of a 5-day, 40-hour workshop where participants would learn to draw using exercises similar to the ones in this book. 
</p>

<p>
I have <a href="https://planetbanatt.net/articles/leetcode.html">written elsewhere</a> about my foundational belief that learning anything requires focused effort spent on deliberate exercises. Drawing is something which for me felt somehow exempt from this process: something where the effort required to become passable at drawing is an hour-count in the thousands, a skill which I have mentally binned as having relatively <a href="https://en.wikipedia.org/wiki/Opportunity_cost">high opportunity cost</a>.
</p>

<p>
However, a lesson I keep learning is that <a href="https://www.reddit.com/r/HipHopImages/comments/2h2y9c/everything_in_the_world_is_exactly_the_same/">Everything in the World is Exactly the Same</a>. 40 hours will not turn you professional at anything, but it's very rare for a skill to be <i>so hard</i> that 40 hours will not turn you into <i>someone who does it</i>. In my case, I wanted to understand line art and perspective, so that I could think about image generation models in a way which would seem useful to somebody who understands line art and perspective, rather than as an artistic layperson. 
</p>
</div>
</div>

<div id="outline-container-orgd4dc84d" class="outline-2">
<h2 id="orgd4dc84d">Is "Democratizing Art" a Sham?</h2>
<div class="outline-text-2" id="text-orgd4dc84d">
<p>
Proponents of AI-based image generation tools often point to a rhetorical point that tools like diffusion models "democratize art", i.e. that they allow people with no skills to create something without spending lots of time becoming good at drawing first. This turn of phrase is something I've always found doubly offensive to people in the art world: first, that it posits that their skills have become (or will become) useless and outdated; second, that it places the operation of a diffusion model on the same level, creatively, as drawing a new composition from scratch.
</p>

<p>
Both of these, I think, are trivially untrue (and, in my view, a point for artists). However, I think a lot of these tools get off on the wrong foot with artists by virtue of being created by and oriented towards users with no art skills. This has created a polarizing environment, where artists refuse to use this "deeply evil and offensive" tool, and researchers continue directing their attention towards capabilities useful for people who will actually use the tools (i.e. away from artists). People who use diffusion models <i>specifically</i> want to use them to <i>avoid</i> learning to draw, aiming towards a future where such a thing would be <i>explicitly unnecessary</i>.
</p>

<p>
I do not believe it needs to be this way! It seems very likely that these tools can be used <i>much better</i> by people who have any capability to evaluate errors in drawings. Tools like controlnet, inpainting, and lora can be used to coax increasingly more precise outputs out of a diffusion model, and it's always felt to me that artist-oriented generative AI tools would be helpful in the same way digital art in general was helpful. For a variety of reasons, this is unpopular to say, and makes both the artists and diffusion model users very upset.
</p>

<p>
I felt that this was not possible to resolve, so I endeavored to become an artist myself, starting with this book. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
